---
kind: type
id: T:Autodesk.Revit.DB.ScheduleSortOrder
source: html/22f0531d-3699-832b-c92e-966562b7c93a.htm
---
# Autodesk.Revit.DB.ScheduleSortOrder

Options for sort order of rows in a schedule.

## Syntax (C#)
```csharp
public enum ScheduleSortOrder
```